In [1]:
import pandas as pd

In [2]:
glogs = pd.read_csv(r'C:\Users\travi\OneDrive\Documents\PennState\classes\2025 spring\DS 440\game_logs.csv')

# Convert date column to datetime, filters out dates before 2005 
glogs['date'] = pd.to_datetime(glogs['date'], format=r'%Y%m%d')
glogs = glogs[glogs['date'].dt.year >= 2005]

# Specify columns to keep for analysis
glogs = glogs[['date', 'day_of_week', 'v_name', 'v_league', 'v_game_number', 'h_name', 'h_league', 
               'h_game_number', 'v_score', 'h_score', 'day_night', 'park_id', 'attendance']]

# Remove international ballparks that were only used for one random game
glogs = glogs[~glogs['park_id'].isin(['SYD01', 'TOK01', "SJU01", 'FTB01', 'LBV01'])]
glogs.head()

C:\Users\travi\AppData\Local\Temp\ipykernel_13356\2179221868.py:1: DtypeWarning: Columns (13,14,15,16,20,21,82,84,86,88,94,95,96,97,98,99,100,101,106,107,109,110,112,113,115,116,118,119,121,122,124,125,127,128,130,131,133,134,136,137,139,140,142,143,145,146,148,149,151,152,154,155,157,158,161) have mixed types. Specify dtype option on import or set low_memory=False.
  glogs = pd.read_csv(r'C:\Users\travi\OneDrive\Documents\PennState\classes\2025 spring\DS 440\game_logs.csv')

,date,day_of_week,v_name,v_league,v_game_number,h_name,h_league,h_game_number,v_score,h_score,day_night,park_id,attendance
142751,2005-04-03,Sun,BOS,AL,1,NYA,AL,1,2,9,N,NYC16,54818.0
142752,2005-04-04,Mon,OAK,AL,1,BAL,AL,1,0,4,D,BAL12,48271.0
142753,2005-04-04,Mon,CLE,AL,1,CHA,AL,1,0,1,D,CHI12,38141.0
142754,2005-04-04,Mon,KCA,AL,1,DET,AL,1,2,11,D,DET05,44105.0
142755,2005-04-04,Mon,MIN,AL,1,SEA,AL,1,1,5,D,SEA03,46249.0

In [3]:
# Rename stadium names in park_id column
# STL09 = Busch Stadium II
# STL10 = Busch Stadium III
# NYC16 = Old Yankee Stadium
# NYC17 = Shea Stadium
# NYC20 = Citi Field
# NYC21 = New Yankee Stadium
# WAS10 = RFK Stadium
# WAS11 = Nationals Park
# MIA01 = Sun Life Stadium
# MIA02 = Marlins Park
# MIN03 = Metrodome
# MIN04 = Target Field
glogs['park_id'] = glogs['park_id'].replace({'ANA01': 'Angels',
                                             'ARL02': 'Rangers',
                                             'ATL02': 'Braves',
                                             'BAL12': 'Orioles',
                                             'BOS07': 'Red Sox',
                                             'CHI11': 'Cubs',
                                             'CHI12': 'White Sox',
                                             'CIN09': 'Reds',
                                             'CLE08': 'Guardians',
                                             'DEN02': 'Rockies',
                                             'DET05': 'Tigers',
                                             'HOU03': 'Astros',
                                             'KAN06': 'Royals',
                                             'LOS03': 'Dodgers',
                                             'MIA01': 'Marlins1',
                                             'MIA02': 'Marlins2',
                                             'MIL06': 'Brewers',
                                             'MIN03': 'Twins1',
                                             'MIN04': 'Twins2',
                                             'NYC16': 'Yankees1',
                                             'NYC17': 'Mets1',
                                             'NYC20': 'Mets2',
                                             'NYC21': 'Yankees2',
                                             'OAK01': 'Athletics',
                                             'PHI13': 'Phillies',
                                             'PHO01': 'Diamondbacks',
                                             'PIT08': 'Pirates',
                                             'SAN02': 'Padres',
                                             'SEA03': 'Mariners',
                                             'SFO03': 'Giants',
                                             'STL09': 'Cardinals1',
                                             'STL10': 'Cardinals2',
                                             'STP01': 'Rays',
                                             'TOR02': 'Blue Jays',
                                             'WAS10': 'Nationals1',
                                             'WAS11': 'Nationals2',
                                             })
glogs.head()

,date,day_of_week,v_name,v_league,v_game_number,h_name,h_league,h_game_number,v_score,h_score,day_night,park_id,attendance
142751,2005-04-03,Sun,BOS,AL,1,NYA,AL,1,2,9,N,Yankees1,54818.0
142752,2005-04-04,Mon,OAK,AL,1,BAL,AL,1,0,4,D,Orioles,48271.0
142753,2005-04-04,Mon,CLE,AL,1,CHA,AL,1,0,1,D,White Sox,38141.0
142754,2005-04-04,Mon,KCA,AL,1,DET,AL,1,2,11,D,Tigers,44105.0
142755,2005-04-04,Mon,MIN,AL,1,SEA,AL,1,1,5,D,Mariners,46249.0

In [4]:
# Rename team abbreviations for consistency with conventional abbreviations
glogs['v_name'] = glogs['v_name'].replace({'ANA':'LAA',
                         'CHA':'CHW',
                         'CHN':'CHC',
                         'FLO':'MIA',
                         'KCA':'KC',
                         'LAN':'LAD',
                         'NYA':'NYY',
                         'NYN':'NYM',
                         'SDN':'SD',
                         'SFN':'SF',
                         'SLN':'STL',
                         'TBA':'TB',
                         'WAS':'WSH'})
glogs['h_name'] = glogs['h_name'].replace({'ANA':'LAA',
                         'CHA':'CHW',
                         'CHN':'CHC',
                         'FLO':'MIA',
                         'KCA':'KC',
                         'LAN':'LAD',
                         'NYA':'NYY',
                         'NYN':'NYM',
                         'SDN':'SD',
                         'SFN':'SF',
                         'SLN':'STL',
                         'TBA':'TB',
                         'WAS':'WSH'})
glogs.head()

,date,day_of_week,v_name,v_league,v_game_number,h_name,h_league,h_game_number,v_score,h_score,day_night,park_id,attendance
142751,2005-04-03,Sun,BOS,AL,1,NYY,AL,1,2,9,N,Yankees1,54818.0
142752,2005-04-04,Mon,OAK,AL,1,BAL,AL,1,0,4,D,Orioles,48271.0
142753,2005-04-04,Mon,CLE,AL,1,CHW,AL,1,0,1,D,White Sox,38141.0
142754,2005-04-04,Mon,KC,AL,1,DET,AL,1,2,11,D,Tigers,44105.0
142755,2005-04-04,Mon,MIN,AL,1,SEA,AL,1,1,5,D,Mariners,46249.0

In [5]:
glogs['time'] = glogs['day_night'].apply(lambda x: pd.to_datetime('13:00:00') if x == 'D' else pd.to_datetime('19:00:00'))
glogs['time'] = glogs['time'].dt.time
glogs.head()

,date,day_of_week,v_name,v_league,v_game_number,h_name,h_league,h_game_number,v_score,h_score,day_night,park_id,attendance,time
142751,2005-04-03,Sun,BOS,AL,1,NYY,AL,1,2,9,N,Yankees1,54818.0,19:00:00
142752,2005-04-04,Mon,OAK,AL,1,BAL,AL,1,0,4,D,Orioles,48271.0,13:00:00
142753,2005-04-04,Mon,CLE,AL,1,CHW,AL,1,0,1,D,White Sox,38141.0,13:00:00
142754,2005-04-04,Mon,KC,AL,1,DET,AL,1,2,11,D,Tigers,44105.0,13:00:00
142755,2005-04-04,Mon,MIN,AL,1,SEA,AL,1,1,5,D,Mariners,46249.0,13:00:00

In [17]:
# Read in weather data
weather_PHI = pd.read_csv(r'C:\Users\travi\OneDrive\Documents\PennState\classes\2025 spring\DS 440\GitHubRepo\DS440_project\weather_PHI.csv')
weather_PHI['date'] = pd.to_datetime(weather_PHI['date'])
weather_PHI['park_id'] = 'Phillies'
weather_PHI.head()

        date  temperature_2m_max (°F)  rain_sum (inch)   park_id
0 2005-04-03                     49.6            0.272  Phillies
1 2005-04-04                     59.8            0.000  Phillies
2 2005-04-05                     66.0            0.000  Phillies
3 2005-04-06                     76.8            0.000  Phillies
4 2005-04-07                     73.7            0.122  Phillies

In [24]:
phi_merged = pd.merge(glogs, weather_PHI, on=['date', 'park_id'], how='left')
phi_merged[phi_merged['park_id'] == "Phillies"].head()

,date,day_of_week,v_name,v_league,v_game_number,h_name,h_league,h_game_number,v_score,h_score,day_night,park_id,attendance,time,temperature_2m_max (°F),rain_sum (inch)
9,2005-04-04,Mon,WSH,NL,1,PHI,NL,1,4,8,D,Phillies,44080.0,13:00:00,59.8,0.000
31,2005-04-06,Wed,WSH,NL,2,PHI,NL,2,7,3,N,Phillies,23435.0,19:00:00,76.8,0.000
40,2005-04-07,Thu,WSH,NL,3,PHI,NL,3,5,4,D,Phillies,21693.0,13:00:00,73.7,0.122
145,2005-04-15,Fri,ATL,NL,10,PHI,NL,10,11,4,N,Phillies,31408.0,19:00:00,55.1,0.000
159,2005-04-16,Sat,ATL,NL,11,PHI,NL,11,1,2,D,Phillies,36820.0,13:00:00,59.1,0.000